QUIZZES = {
    1: {
        "title": "Введение в ML",
        "question": "Какой тип машинного обучения использует размеченные данные?\n\nA) Обучение с учителем\nB) Обучение без учителя\nC) Обучение с подкреплением",
        "correct_answer": "A"
    },
    2: {
        "title": "Обучение с учителем",
        "question": "Какой алгоритм лучше всего подходит для задачи прогнозирования числовых значений?\n\nA) K-means\nB) Linear Regression\nC) DBSCAN",
        "correct_answer": "B"
    },
    3: {
        "title": "Обучение без учителя",
        "question": "Какой алгоритм используется для группировки похожих объектов?\n\nA) Linear Regression\nB) Decision Trees\nC) K-means",
        "correct_answer": "C"
    },
    4: {
        "title": "Обучение с подкреплением",
        "question": "Что является ключевым компонентом в RL?\n\nA) Размеченные данные\nB) Система наград\nC) Кластеризация данных",
        "correct_answer": "B"
    },
    5: {
        "title": "Нейронные сети",
        "question": "Какой тип нейронных сетей наиболее эффективен для обработки изображений?\n\nA) RNN\nB) CNN\nC) Feedforward",
        "correct_answer": "B"
    },
    6: {
        "title": "Подготовка данных",
        "question": "Какой метод используется для преобразования категориальных переменных в числовые?\n\nA) Нормализация\nB) Кодирование\nC) Агрегация",
        "correct_answer": "B"
    },
    7: {
        "title": "Оценка моделей",
        "question": "Какая метрика наиболее подходит для оценки модели с несбалансированными классами?\n\nA) Accuracy\nB) F1-score\nC) MSE",
        "correct_answer": "B"
    },
    8: {
        "title": "Оптимизация гиперпараметров",
        "question": "Какой метод оптимизации лучше всего работает с большим пространством параметров?\n\nA) Grid Search\nB) Random Search\nC) Bayesian Optimization",
        "correct_answer": "C"
    },
    9: {
        "title": "Глубокое обучение",
        "question": "Какая архитектура произвела революцию в NLP?\n\nA) CNN\nB) Transformers\nC) GAN",
        "correct_answer": "B"
    },
    10: {
        "title": "MLOps",
        "question": "Что является ключевым аспектом MLOps?\n\nA) Ручная настройка\nB) Автоматизация процессов\nC) Одноразовое развертывание",
        "correct_answer": "B"
    },
    11: {
        "title": "Этика в ML",
        "question": "Какой аспект этики ML связан с пониманием решений модели?\n\nA) Конфиденциальность\nB) Интерпретируемость\nC) Масштабируемость",
        "correct_answer": "B"
    }
}